AngularSpecter/Laser_controller/Workspace/Laser Controller/driverlib/MSP430F5xx_6xx/adc12_a.c
    return ( retVal) ;
}

//*****************************************************************************
//
//! Enables the ADC12_A block.
//!
//! \param baseAddress is the base address of the ADC12_A module.
//!
//! This will enable operation of the ADC12_A block.
//! Modified bits are \b ADC12ON of \b ADC12CTL0 register.
//!
//! \return None.
//
//*****************************************************************************
void ADC12_A_enable (uint32_t baseAddress)
{
    //Enable the ADC12_A Module
    HWREG8(baseAddress + OFS_ADC12CTL0_L) |= ADC12ON;
}

//*****************************************************************************
//
//! Disables the ADC12_A block.
//!
//! \param baseAddress is the base address of the ADC12_A module.
//!
//! This will disable operation of the ADC12_A block.
//! Modified bits are \b ADC12ON of \b ADC12CTL0 register.
//!
//! \return None.
//
//*****************************************************************************
void ADC12_A_disable (uint32_t baseAddress)
{
    //Disable ADC12_A module
    HWREG8(baseAddress + OFS_ADC12CTL0_L) &= ~ADC12ON;
}


//*****************************************************************************
//
//! Sets up and enables the Sampling Timer Pulse Mode.
//!
//! \param baseAddress is the base address of the ADC12_A module.
//! \param clockCycleHoldCountLowMem sets the amount of clock cycles to
//!       sample-and-hold for the higher memory buffers 0-7.
//!        Valid values are
//!        \b ADC12_A_CYCLEHOLD_4_CYCLES [Default]
//!        \b ADC12_A_CYCLEHOLD_8_CYCLES
//!        \b ADC12_A_CYCLEHOLD_16_CYCLES
//!        \b ADC12_A_CYCLEHOLD_32_CYCLES
//!        \b ADC12_A_CYCLEHOLD_64_CYCLES
//!        \b ADC12_A_CYCLEHOLD_96_CYCLES
//!        \b ADC12_A_CYCLEHOLD_128_CYCLES
//!        \b ADC12_A_CYCLEHOLD_192_CYCLES
//!        \b ADC12_A_CYCLEHOLD_256_CYCLES
//!        \b ADC12_A_CYCLEHOLD_384_CYCLES
//!        \b ADC12_A_CYCLEHOLD_512_CYCLES
//!        \b ADC12_A_CYCLEHOLD_768_CYCLES
//!        \b ADC12_A_CYCLEHOLD_1024_CYCLES
//!        Modified bits are \b ADC12SHT0x of \b ADC12CTL0 register.
//! \param clockCycleHoldCountHighMem sets the amount of clock cycles to
//!       sample-and-hold for the higher memory buffers 8-15.
//!        Valid values are
//!        \b ADC12_A_CYCLEHOLD_4_CYCLES [Default]
//!        \b ADC12_A_CYCLEHOLD_8_CYCLES
//!        \b ADC12_A_CYCLEHOLD_16_CYCLES
//!        \b ADC12_A_CYCLEHOLD_32_CYCLES
//!        \b ADC12_A_CYCLEHOLD_64_CYCLES
//!        \b ADC12_A_CYCLEHOLD_96_CYCLES
//!        \b ADC12_A_CYCLEHOLD_128_CYCLES
//!        \b ADC12_A_CYCLEHOLD_192_CYCLES
//!        \b ADC12_A_CYCLEHOLD_256_CYCLES
//!        \b ADC12_A_CYCLEHOLD_384_CYCLES
//!        \b ADC12_A_CYCLEHOLD_512_CYCLES
//!        \b ADC12_A_CYCLEHOLD_768_CYCLES
//!        \b ADC12_A_CYCLEHOLD_1024_CYCLES
//!        Modified bits are \b ADC12SHT1x of \b ADC12CTL0 register.
//! \param multipleSamplesEnabled allows multiple conversions to start
//!       without a trigger signal from the sample/hold signal
//!        Valid values are
//!        \b ADC12_A_MULTIPLESAMPLESDISABLE - a timer trigger will be needed to
//!                  start every ADC conversion. [Default]
//!        \b ADC12_A_MULTIPLESAMPLESENABLE  - during a sequenced and/or repeated
//!                  conversion mode, after the first conversion, no sample/hold
//!                  signal is necessary to start subsequent sample/hold and
//!                  convert processes.
//!        Modified bits are \b ADC12MSC of \b ADC12CTL0 register.
//!
//! This function sets up the sampling timer pulse mode which allows the
//! sample/hold signal to trigger a sampling timer to sample-and-hold an input
//! signal for a specified number of clock cycles without having to hold the
//! sample/hold signal for the entire period of sampling. Note that if a
//! conversion has been started with the startConversion() function, then a call
//! to disableConversions() is required before this function may be called.
//!
//! \return NONE
//
//*****************************************************************************
void ADC12_A_setupSamplingTimer (uint32_t baseAddress,
    uint16_t clockCycleHoldCountLowMem,
    uint16_t clockCycleHoldCountHighMem,
    unsigned short multipleSamplesEnabled)
{
    //Make sure the ENC bit is cleared before setting up sampling pulse mode
    assert( !(HWREG8(baseAddress + OFS_ADC12CTL0_L) & ADC12ENC) );

    assert(clockCycleHoldCountLowMem <= ADC12_A_CYCLEHOLD_1024_CYCLES);
    assert(clockCycleHoldCountHighMem <= ADC12_A_CYCLEHOLD_1024_CYCLES);

    HWREG16(baseAddress + OFS_ADC12CTL1) |= ADC12SHP;

    //Reset clock cycle hold counts and msc bit before setting them
    HWREG16(baseAddress + OFS_ADC12CTL0) &=
        ~(ADC12SHT0_15 + ADC12SHT1_15 + ADC12MSC);

    //Set clock cycle hold counts and msc bit
    HWREG16(baseAddress + OFS_ADC12CTL0) |= clockCycleHoldCountLowMem
                                          + (clockCycleHoldCountHighMem << 4)
                                          + multipleSamplesEnabled;
}

//*****************************************************************************
//
//! Disables Sampling Timer Pulse Mode.
//!
//! \param baseAddress is the base address of the ADC12_A module.
//!
//! Disables the Sampling Timer Pulse Mode. Note that if a conversion has been
//! started with the startConversion() function, then a call to
//! disableConversions() is required before this function may be called.
//!
//! Modified bits are \b ADC12SHP of \b ADC12CTL0 register.
//! \return NONE
//
//*****************************************************************************
void ADC12_A_disableSamplingTimer (uint32_t baseAddress)
{
    //Make sure the ENC bit is cleared before disabling sampling pulse mode
    assert( !(HWREG8(baseAddress + OFS_ADC12CTL0_L) & ADC12ENC) );

    HWREG16(baseAddress + OFS_ADC12CTL1) &= ~(ADC12SHP);
}

//*****************************************************************************
//
//! Configures the controls of the selected memory buffer.
//!
//! \param baseAddress is the base address of the ADC12_A module.
//! \param memoryBufferControlIndex is the selected memory buffer to set the
//!       configuration for.
//!        Valid values are
//!        \b ADC12_A_MEMORY_0 [Default]
//!        \b ADC12_A_MEMORY_1
//!        \b ADC12_A_MEMORY_2
//!        \b ADC12_A_MEMORY_3
//!        \b ADC12_A_MEMORY_4
//!        \b ADC12_A_MEMORY_5
//!        \b ADC12_A_MEMORY_6
//!        \b ADC12_A_MEMORY_7
//!        \b ADC12_A_MEMORY_8
//!        \b ADC12_A_MEMORY_9
//!        \b ADC12_A_MEMORY_10
//!        \b ADC12_A_MEMORY_11
//!        \b ADC12_A_MEMORY_12
//!        \b ADC12_A_MEMORY_13
//!        \b ADC12_A_MEMORY_14
//!        \b ADC12_A_MEMORY_15
//! \param inputSourceSelect is the input that will store the converted data
//!       into the specified memory buffer.
//!        Valid values are
//!        \b ADC12_A_INPUT_A0 [Default]
//!        \b ADC12_A_INPUT_A1
//!        \b ADC12_A_INPUT_A2
//!        \b ADC12_A_INPUT_A3
//!        \b ADC12_A_INPUT_A4
//!        \b ADC12_A_INPUT_A5
//!        \b ADC12_A_INPUT_A6
//!        \b ADC12_A_INPUT_A7
//!        \b ADC12_A_INPUT_A8
//!        \b ADC12_A_INPUT_A9
//!        \b ADC12_A_INPUT_TEMPSENSOR
//!        \b ADC12_A_INPUT_BATTERYMONITOR
//!        \b ADC12_A_INPUT_A12
//!        \b ADC12_A_INPUT_A13
//!        \b ADC12_A_INPUT_A14
//!        \b ADC12_A_INPUT_A15
//!        Modified bits are \b ADC12INCHx of \b ADC12MCTLx register.
//! \param positiveRefVoltageSourceSelect is the reference voltage source to set
//!       as the upper limit for the conversion stored in the specified memory.
//!        Valid values are
//!        \b ADC12_A_VREFPOS_AVCC [Default]
//!        \b ADC12_A_VREFPOS_EXT
//!        \b ADC12_A_VREFPOS_INT
//!        Modified bits are \b ADC12SREF of \b ADC12MCTLx register.
//! \param negativeRefVoltageSourceSelect is the reference voltage source to set
//!       as the lower limit for the conversion stored in the specified memory.
//!        Valid values are
//!        \b ADC12_A_VREFNEG_AVSS [Default]
//!        \b ADC12_A_VREFNEG_EXT
//!        Modified bits are \b ADC12SREF of \b ADC12MCTLx register.
//! \param endOfSequence indicates that the specified memory buffer will be
//!       the end of the sequence if a sequenced conversion mode is selected
//!        Valid values are
//!        \b ADC12_A_NOTENDOFSEQUENCE - The specified memory buffer will NOT be the
//!                  end of the sequence OR a sequenced conversion mode is not
//!                  selected. [Default]
//!        \b ADC12_A_ENDOFSEQUENCE  - The specified memory buffer will be the end
//!                  of the sequence.
//!        Modified bits are \b ADC12EOS of \b ADC12MCTLx register.
//!
//! Maps an input signal conversion into the selected memory buffer, as
//! well as the positive and negative reference voltages for each conversion
//! being stored into this memory buffer. If the internal reference is used for
//! the positive reference voltage, the internal REF module must be used to
//! control the voltage level. Note that if a conversion has been started with
//! the startConversion() function, then a call to disableConversions() is
//! required before this function may be called.
//!
//! \return NONE
//
//*****************************************************************************
void ADC12_A_memoryConfigure (uint32_t baseAddress,
    uint8_t memoryBufferControlIndex,
    uint8_t inputSourceSelect,
    uint8_t positiveRefVoltageSourceSelect,
    uint8_t negativeRefVoltageSourceSelect,
    unsigned short endOfSequence)
{
    //Make sure the ENC bit is cleared before configuring a Memory Buffer Control
    assert( !(HWREG8(baseAddress + OFS_ADC12CTL0_L) & ADC12ENC) );

    assert(memoryBufferControlIndex <= ADC12_A_MEMORY_15);
    assert(inputSourceSelect <= ADC12_A_INPUT_A15);
    assert(positiveRefVoltageSourceSelect <= ADC12_A_VREFPOS_INT);
    assert(negativeRefVoltageSourceSelect <= ADC12_A_VREFNEG_EXT);

    //Set the offset in respect to ADC12MCTL0
    uint16_t memoryBufferControlOffset =
        (OFS_ADC12MCTL0 + memoryBufferControlIndex);

