AngularSpecter/Laser_controller/Workspace/Laser Controller/driverlib/MSP430F5xx_6xx/adc12_a.c
    //Reset the memory buffer control and Set the input source
    HWREG8(baseAddress + memoryBufferControlOffset) =
        inputSourceSelect //Set Input Source
        + positiveRefVoltageSourceSelect //Set Vref+
        + negativeRefVoltageSourceSelect //Set Vref-
        + endOfSequence; //Set End of Sequence
}

//*****************************************************************************
//
//! Enables selected ADC12_A interrupt sources.
//!
//! \param baseAddress is the base address of the ADC12_A module.
//! \param memoryInterruptMask is the bit mask of the memory buffer and overflow
//!       interrupt sources to be enabled.
//!        Mask values is the logical OR of any of the following
//!        \b ADC12IE0 - new conversion data in the 0th memory buffer
//!        \b ADC12IE1 - new conversion data in the 1st memory buffer
//!        \b ADC12IE2 - new conversion data in the 2nd memory buffer
//!        \b ADC12IE3 - new conversion data in the 3rd memory buffer
//!        \b ADC12IE4 - new conversion data in the 4th memory buffer
//!        \b ADC12IE5 - new conversion data in the 5th memory buffer
//!        \b ADC12IE6 - new conversion data in the 6th memory buffer
//!        \b ADC12IE7 - new conversion data in the 7th memory buffer
//!        \b ADC12IE8 - new conversion data in the 8th memory buffer
//!        \b ADC12IE9 - new conversion data in the 9th memory buffer
//!        \b ADC12IE10 - new conversion data in the 10th memory buffer
//!        \b ADC12IE11 - new conversion data in the 11th memory buffer
//!        \b ADC12IE12 - new conversion data in the 12th memory buffer
//!        \b ADC12IE13 - new conversion data in the 13th memory buffer
//!        \b ADC12IE14 - new conversion data in the 14th memory buffer
//!        \b ADC12IE15 - new conversion data in the 15th memory buffer
//!        \b ADC12OVIE0 - a conversion is about to save to a memory buffer that
//!                  has not been read out yet.
//!        \b ADC12TOVIE0 - a conversion is about to start before the previous
//!                  conversion has been completed.
//!
//! Enables the indicated ADC12_A interrupt sources.  Only the sources that
//! are enabled can be reflected to the processor interrupt; disabled sources
//! have no effect on the processor. <b>Does not clear interrupt flags.</b>
//!
//! \return NONE
//
//*****************************************************************************
void ADC12_A_enableInterrupt (uint32_t baseAddress,
    uint32_t interruptMask)
{
    assert(interruptMask <= (ADC12IE0 +
                             ADC12IE1 +
                             ADC12IE2 +
                             ADC12IE3 +
                             ADC12IE4 +
                             ADC12IE5 +
                             ADC12IE6 +
                             ADC12IE7 +
                             ADC12IE8 +
                             ADC12IE9 +
                             ADC12IE10 +
                             ADC12IE11 +
                             ADC12IE12 +
                             ADC12IE13 +
                             ADC12IE14 +
                             ADC12IE15 +
                             ADC12OVIE0 +
                             ADC12TOVIE0
          ));
        
    if (interruptMask & ADC12TOVIE0){
        HWREG16(baseAddress + OFS_ADC12CTL0) |= ADC12TOVIE;
        interruptMask &= ~ADC12TOVIE0;
    }
    if (interruptMask & ADC12OVIE0){
        HWREG16(baseAddress + OFS_ADC12CTL0) |= ADC12OVIE;
        interruptMask &= ~ADC12OVIE0;
    }
    
    HWREG16(baseAddress + OFS_ADC12IE) |= interruptMask;
}

//*****************************************************************************
//
//! Disables selected ADC12_A interrupt sources.
//!
//! \param baseAddress is the base address of the ADC12_A module.
//! \param memoryInterruptMask is the bit mask of the memory buffer and overflow
//!       interrupt sources to be disabled.
//!        Mask values is the logical OR of any of the following
//!        \b ADC12IE0 - new conversion data in the 0th memory buffer
//!        \b ADC12IE1 - new conversion data in the 1st memory buffer
//!        \b ADC12IE2 - new conversion data in the 2nd memory buffer
//!        \b ADC12IE3 - new conversion data in the 3rd memory buffer
//!        \b ADC12IE4 - new conversion data in the 4th memory buffer
//!        \b ADC12IE5 - new conversion data in the 5th memory buffer
//!        \b ADC12IE6 - new conversion data in the 6th memory buffer
//!        \b ADC12IE7 - new conversion data in the 7th memory buffer
//!        \b ADC12IE8 - new conversion data in the 8th memory buffer
//!        \b ADC12IE9 - new conversion data in the 9th memory buffer
//!        \b ADC12IE10 - new conversion data in the 10th memory buffer
//!        \b ADC12IE11 - new conversion data in the 11th memory buffer
//!        \b ADC12IE12 - new conversion data in the 12th memory buffer
//!        \b ADC12IE13 - new conversion data in the 13th memory buffer
//!        \b ADC12IE14 - new conversion data in the 14th memory buffer
//!        \b ADC12IE15 - new conversion data in the 15th memory buffer
//!        \b ADC12OVIE0 - a conversion is about to save to a memory buffer that
//!                  has not been read out yet.
//!        \b ADC12TOVIE0 - a conversion is about to start before the previous
//!                  conversion has been completed.
//!
//! Disables the indicated ADC12_A interrupt sources.  Only the sources that
//! are enabled can be reflected to the processor interrupt; disabled sources
//! have no effect on the processor.
//!
//! Modified registers are \b ADC12CTL0 and \b ADC12IE.
//!
//! \return NONE
//
//*****************************************************************************
void ADC12_A_disableInterrupt (uint32_t baseAddress,
    uint32_t interruptMask)
{
    assert(interruptMask <= (ADC12IE0 +
                             ADC12IE1 +
                             ADC12IE2 +
                             ADC12IE3 +
                             ADC12IE4 +
                             ADC12IE5 +
                             ADC12IE6 +
                             ADC12IE7 +
                             ADC12IE8 +
                             ADC12IE9 +
                             ADC12IE10 +
                             ADC12IE11 +
                             ADC12IE12 +
                             ADC12IE13 +
                             ADC12IE14 +
                             ADC12IE15 +
                             ADC12OVIE0 +
                             ADC12TOVIE0
           ));
        
    
    if (interruptMask & ADC12TOVIE0){
        HWREG16(baseAddress + OFS_ADC12CTL0) &= ~(ADC12TOVIE);
        interruptMask &= ~ADC12TOVIE0;
    }
    if (interruptMask & ADC12OVIE0){
        HWREG16(baseAddress + OFS_ADC12CTL0) &= ~(ADC12OVIE);
        interruptMask &= ~ADC12OVIE0;
    }
    
