AngularSpecter/Laser_controller/Workspace/Laser Controller/driverlib/MSP430F5xx_6xx/adc12_a.c
    HWREG16(baseAddress + OFS_ADC12IE) &= ~(interruptMask);
}

//*****************************************************************************
//
//! Clears ADC12_A selected interrupt flags.
//!
//! \param baseAddress is the base address of the ADC12_A module.
//! \param memoryInterruptFlagMask is a bit mask of the interrupt flags to be
//!       cleared.
//!        Mask value is the logical OR of any of the following
//!        \b ADC12IFG0 - Flag of  the 0th memory buffer interrupt
//!        \b ADC12IFG1 - Flag of  the 1st memory buffer interrupt
//!        \b ADC12IFG2 - Flag of  the 2nd memory buffer interrupt
//!        \b ADC12IFG3 - Flag of  the 3rd memory buffer interrupt
//!        \b ADC12IFG4 - Flag of  the 4th memory buffer interrupt
//!        \b ADC12IFG5 - Flag of  the 5th memory buffer interrupt
//!        \b ADC12IFG6 - Flag of  the 6th memory buffer interrupt
//!        \b ADC12IFG7 - Flag of  the 7th memory buffer interrupt
//!        \b ADC12IFG8 - Flag of  the 8th memory buffer interrupt
//!        \b ADC12IFG9 - Flag of  the 9th memory buffer interrupt
//!        \b ADC12IFG10 - Flag of  the 10th memory buffer interrupt
//!        \b ADC12IFG11 - Flag of  the 11th memory buffer interrupt
//!        \b ADC12IFG12 - Flag of  the 12th memory buffer interrupt
//!        \b ADC12IFG13 - Flag of  the 13th memory buffer interrupt
//!        \b ADC12IFG14 - Flag of  the 14th memory buffer interrupt
//!        \b ADC12IFG15 - Flag of  the 15th memory buffer interrupt
//!
//! The selected ADC12_A interrupt flags are cleared, so that it no longer asserts.
//! The memory buffer interrupt flags are only cleared when the memory buffer is
//! accessed. Note that the overflow interrupts do not have an interrupt flag to
//! clear; they must be accessed directly from the interrupt vector.
//!
//! Modified registers are \b ADC12IFG.
//
//! \return NONE
//
//*****************************************************************************
void ADC12_A_clearInterrupt (uint32_t baseAddress,
    uint16_t memoryInterruptFlagMask)
{
    HWREG16(baseAddress + OFS_ADC12IFG) &= ~(memoryInterruptFlagMask);
}

//*****************************************************************************
//
//! Returns the status of the selected memory interrupt flags.
//!
//! \param baseAddress is the base address of the ADC12_A module.
//! \param memoryInterruptFlagMask is a bit mask of the interrupt flags status
//!       to be returned.
//!        Mask value is the logical OR of any of the following
//!        \b ADC12IFG0 - Flag of the 0th memory buffer interrupt
//!        \b ADC12IFG1 - Flag of the 1st memory buffer interrupt
//!        \b ADC12IFG2 - Flag of the 2nd memory buffer interrupt
//!        \b ADC12IFG3 - Flag of the 3rd memory buffer interrupt
//!        \b ADC12IFG4 - Flag of the 4th memory buffer interrupt
//!        \b ADC12IFG5 - Flag of the 5th memory buffer interrupt
//!        \b ADC12IFG6 - Flag of the 6th memory buffer interrupt
//!        \b ADC12IFG7 - Flag of the 7th memory buffer interrupt
//!        \b ADC12IFG8 - Flag of the 8th memory buffer interrupt
//!        \b ADC12IFG9 - Flag of the 9th memory buffer interrupt
//!        \b ADC12IFG10 - Flag of the 10th memory buffer interrupt
//!        \b ADC12IFG11 - Flag of the 11th memory buffer interrupt
//!        \b ADC12IFG12 - Flag of the 12th memory buffer interrupt
//!        \b ADC12IFG13 - Flag of the 13th memory buffer interrupt
//!        \b ADC12IFG14 - Flag of the 14th memory buffer interrupt
//!        \b ADC12IFG15 - Flag of the 15th memory buffer interrupt
//!
//! Returns the status of the selected memory interrupt flags. Note that the
//! overflow interrupts do not have an interrupt flag to clear; they must be
//! accessed directly from the interrupt vector.
//!

//! \return The current interrupt flag status for the corresponding mask.
//
//*****************************************************************************
uint8_t ADC12_A_getInterruptStatus (uint32_t baseAddress,
    uint16_t memoryInterruptFlagMask)
{
    return ( HWREG16(baseAddress + OFS_ADC12IFG) & memoryInterruptFlagMask );
}

//*****************************************************************************
//
//! Enables/Starts an Analog-to-Digital Conversion.
//!
//! \param baseAddress is the base address of the ADC12_A module.
//! \param startingMemoryBufferIndex is the memory buffer that will hold the
//!       first or only conversion.
//!        Valid values are
//!        \b ADC12_A_MEMORY_0 [Default]
//!        \b ADC12_A_MEMORY_1
//!        \b ADC12_A_MEMORY_2
//!        \b ADC12_A_MEMORY_3
//!        \b ADC12_A_MEMORY_4
//!        \b ADC12_A_MEMORY_5
//!        \b ADC12_A_MEMORY_6
//!        \b ADC12_A_MEMORY_7
//!        \b ADC12_A_MEMORY_8
//!        \b ADC12_A_MEMORY_9
//!        \b ADC12_A_MEMORY_10
//!        \b ADC12_A_MEMORY_11
//!        \b ADC12_A_MEMORY_12
//!        \b ADC12_A_MEMORY_13
//!        \b ADC12_A_MEMORY_14
//!        \b ADC12_A_MEMORY_15
//!        Modified bits are \b ADC12STARTADDx of \b ADC12CTL1 register.
//! \param conversionSequenceModeSelect determines the ADC operating mode.
//!        Valid values are
//!        \b ADC12_A_SINGLECHANNEL - one-time conversion of a single channel into
//!           a single memory buffer. [Default]
//!        \b ADC12_A_SEQOFCHANNELS - one time conversion of multiple channels
//!           into the specified starting memory buffer and each subsequent
//!           memory buffer up until the conversion is stored in a memory buffer
//!           dedicated as the end-of-sequence by the memory's control register.
//!        \b ADC12_A_REPEATED_SINGLECHANNEL - repeated conversions of one channel
//!           into a single memory buffer.
//!        \b ADC12_A_REPEATED_SEQOFCHANNELS - repeated conversions of multiple
//!           channels into the specified starting memory buffer and each
//!           subsequent memory buffer up until the conversion is stored in a
//!           memory buffer dedicated as the end-of-sequence by the memory's
//!           control register.
//!        Modified bits are \b ADC12CONSEQx of \b ADC12CTL1 register.
//!
//! This function  enables/starts the conversion process of the ADC.
//! If the sample/hold signal source chosen during initialization was
//! ADC12OSC, then the conversion is started immediately, otherwise the chosen
//! sample/hold signal source starts the conversion by a rising edge of the
//! signal. Keep in mind when selecting conversion modes, that for sequenced
//! and/or repeated modes, to keep the sample/hold-and-convert process
//! continuing without a trigger from the sample/hold signal source, the
//! multiple samples must be enabled using the ADC12_A_setupSamplingTimer()
//! function. Note that after this function is called, the
//! ADC12_A_disableConversions() has to be called to re-initialize the ADC,
//! reconfigure a memory buffer control, enable/disable the sampling timer, or
//! to change the internal reference voltage.
//!
//! Modified registers are \b ADC12CTL0 and \b ADC12CTL1.
//! \return NONE
//
//*****************************************************************************
void ADC12_A_startConversion (uint32_t baseAddress,
    uint16_t startingMemoryBufferIndex,
    uint8_t conversionSequenceModeSelect)
{
    assert(startingMemoryBufferIndex <= ADC12_A_MEMORY_15);
    assert(conversionSequenceModeSelect <= ADC12_A_REPEATED_SEQOFCHANNELS);

    //Reset the ENC bit to set the starting memory address and conversion mode
    //sequence
    HWREG8(baseAddress + OFS_ADC12CTL0_L) &= ~(ADC12ENC);
    //Reset the bits about to be set
    HWREG16(baseAddress + OFS_ADC12CTL1) &= ~(ADC12CSTARTADD_15 + ADC12CONSEQ_3);

