AngularSpecter/Laser_controller/Workspace/Laser Controller/driverlib/MSP430F5xx_6xx/adc12_a.c
    HWREG8(baseAddress + OFS_ADC12CTL1_H) |= (startingMemoryBufferIndex << 4);
    HWREG8(baseAddress + OFS_ADC12CTL1_L) |= conversionSequenceModeSelect;
    HWREG8(baseAddress + OFS_ADC12CTL0_L) |= ADC12ENC + ADC12SC;
}

//*****************************************************************************
//
//! Disables the ADC from converting any more signals.
//!
//! \param baseAddress is the base address of the ADC12_A module.
//! \param preempt specifies if the current conversion should be preemptly
//!       stopped before the end of the conversion.
//!        Valid values are
//!        \b ADC12_A_COMPLETECONVERSION - Allows the ADC12_A to end the current
//!                  conversion before disabling conversions.
//!        \b ADC12_A_PREEMPTCONVERSION - Stops the ADC12_A immediatly, with
//!                  unpredicatble results of the current conversion.
//!
//! Disables the ADC from converting any more signals.
//! If there is a conversion in progress, this function can stop it immediatly
//! if the preempt parameter is set as TRUE, by changing the conversion mode to
//! single-channel, single-conversion and disabling conversions. If the
//! conversion mode is set as single-channel, single-conversion and this
//! function is called without preemption, then the ADC core conversion status
//! is polled until the conversion is complete before disabling conversions to
//! prevent unpredictable data. If the ADC12_A_startConversion() has been called,
//! then this function has to be called to re-initialize the ADC, reconfigure a
//! memory buffer control, enable/disable the sampling pulse mode, or change the
//! internal reference voltage.
//!
//! Modified registers are \b ADC12CTL0 and \b ADC12CTL1.
//!
//! \return NONE
//
//*****************************************************************************
void ADC12_A_disableConversions (uint32_t baseAddress, unsigned short preempt)
{
    if (ADC12_A_PREEMPTCONVERSION == preempt){
        HWREG8(baseAddress + OFS_ADC12CTL1_L) &= ~(ADC12CONSEQ_3);
        //Reset conversion sequence mode to single-channel, single-conversion
    } else if (~(HWREG8(baseAddress + OFS_ADC12CTL1_L) & ADC12CONSEQ_3)){
        //To prevent preemoption of a single-channel, single-conversion we must
        //wait for the ADC core to finish the conversion.
        while (ADC12_A_isBusy(baseAddress)) ;
    }

    HWREG8(baseAddress + OFS_ADC12CTL0_L) &= ~(ADC12ENC);
}

//*****************************************************************************
//
//! Returns the raw contents of the specified memory buffer.
//!
//! \param baseAddress is the base address of the ADC12_A module.
//! \param memryBufferIndex is the specified Memory Buffer to read.
//!        Valid values are
//!        \b ADC12_A_MEMORY_0 [Default]
//!        \b ADC12_A_MEMORY_1
//!        \b ADC12_A_MEMORY_2
//!        \b ADC12_A_MEMORY_3
//!        \b ADC12_A_MEMORY_4
//!        \b ADC12_A_MEMORY_5
//!        \b ADC12_A_MEMORY_6
//!        \b ADC12_A_MEMORY_7
//!        \b ADC12_A_MEMORY_8
//!        \b ADC12_A_MEMORY_9
//!        \b ADC12_A_MEMORY_10
//!        \b ADC12_A_MEMORY_11
//!        \b ADC12_A_MEMORY_12
//!        \b ADC12_A_MEMORY_13
//!        \b ADC12_A_MEMORY_14
//!        \b ADC12_A_MEMORY_15
//!
//! Returns the raw contents of the specified memory buffer. The format of the
//! content depends on the read-back format of the data: if the data is in
//! signed 2's complement format then the contents in the memory buffer will be
//! left-justified with the least-siginificant bits as 0's, whereas if the data
//! is in unsigned format then the contents in the memory buffer will be
//! right-justified with the most-significant bits as 0's.
//!
//! \return A Signed Integer of the contents of the specified memory buffer.
//
//*****************************************************************************
int ADC12_A_getResults (uint32_t baseAddress, uint8_t memoryBufferIndex)
{
    assert(memoryBufferIndex <= ADC12_A_MEMORY_15);

    return ( HWREG16(baseAddress + (0x20 + (memoryBufferIndex * 2))) );
    //(0x20 + (memoryBufferIndex * 2)) == offset of ADC12MEMx
}

//*****************************************************************************
//
//! Use to change the resolution of the converted data.
//!
//! \param baseAddress is the base address of the ADC12_A module.
//! \param resolutionSelect determines the resolution of the converted data.
//!        Valid values are
//!        \b ADC12_A_RESOLUTION_8BIT
//!        \b ADC12_A_RESOLUTION_10BIT
//!        \b ADC12_A_RESOLUTION_12BIT [Default]
//!        Modified bits are \b ADC12RESx of \b ADC12CTL2 register.
//!
//! This function can be used to change the resolution of the converted data
//! from the default of 12-bits.
//!
//! \return NONE
//
//*****************************************************************************
void ADC12_A_setResolution (uint32_t baseAddress,
    uint8_t resolutionSelect)
{
    assert(resolutionSelect <= ADC12_A_RESOLUTION_12BIT);

    HWREG8(baseAddress + OFS_ADC12CTL2_L) &= ~(ADC12RES_3);
    HWREG8(baseAddress + OFS_ADC12CTL2_L) |= resolutionSelect;
}

//*****************************************************************************
//
//! Use to invert or un-invert the sample/hold signal.
//!
//! \param baseAddress is the base address of the ADC12_A module.
//! \param invertedSignal set if the sample/hold signal should be inverted
//!        Valid values are
//!        \b ADC12_A_NONINVERTEDSIGNAL - a sample-and-hold of an input signal for
//!                  conversion will be started on a rising edge of the
//!                  sample/hold signal. [Default]
//!        \b ADC12_A_INVERTEDSIGNAL  - a sample-and-hold of an input signal for
//!                  conversion will be started on a falling edge of the
//!                  sample/hold signal.
//!        Modified bits are \b ADC12ISSH of \b ADC12CTL1 register.
//!
//! This function can be used to invert or un-invert the sample/hold signal.
//! Note that if a conversion has been started with the startConversion()
//! function, then a call to disableConversions() is required before this
//! function may be called.
//!
//! \return NONE
//
//*****************************************************************************
void ADC12_A_setSampleHoldSignalInversion (uint32_t baseAddress,
    uint16_t invertedSignal)
{
    //Make sure the ENC bit is cleared before using this function
    assert( !(HWREG8(baseAddress + OFS_ADC12CTL0_L) & ADC12ENC) );

    HWREG16(baseAddress + OFS_ADC12CTL1) &= ~(ADC12ISSH);
    HWREG16(baseAddress + OFS_ADC12CTL1) |= invertedSignal;
}

//*****************************************************************************
//
//! Use to set the read-back format of the converted data.
//!
//! \param baseAddress is the base address of the ADC12_A module.
//! \param readBackFormat is the specified format to store the conversions in
//!       the memory buffer.
//!        Valid values are
//!        \b ADC12_A_UNSIGNED_BINARY [Default]
//!        \b ADC12_A_SIGNED_2SCOMPLEMENT
//!        Modified bits are \b ADC12DF of \b ADC12CTL2 register.
//!
//! Sets the format of the converted data: how it will be stored into the
//! memory buffer, and how it should be read back. The format can be set as
//! right-justified (default), which indicates that the number will be unsigned,
//! or left-justified, which indicates that the number will be signed in
//! 2's complement format. This change affects all memory buffers for subsequent
//! conversions.
//!
//! \return NONE
//
//*****************************************************************************
void ADC12_A_setDataReadBackFormat (uint32_t baseAddress,
    unsigned short readBackFormat)
{
    assert(readBackFormat <= ADC12_A_SIGNED_2SCOMPLEMENT);

