AngularSpecter/Laser_controller/Workspace/Laser Controller/driverlib/MSP430F5xx_6xx/adc12_a.c
    HWREG8(baseAddress + OFS_ADC12CTL2_L) &= ~(ADC12DF);
    HWREG8(baseAddress + OFS_ADC12CTL2_L) |= readBackFormat;
}

//*****************************************************************************
//
//! Enables the reference buffer's burst ability.
//!
//! \param baseAddress is the base address of the ADC12_A module.
//!
//! Enables the reference buffer's burst ability, allowing the reference buffer
//! to turn off while the ADC is not converting, and automatically turning on
//! when the ADC needs the generated reference voltage for a conversion.
//!
//! \return NONE
//
//*****************************************************************************
void ADC12_A_enableReferenceBurst (uint32_t baseAddress)
{
    HWREG8(baseAddress + OFS_ADC12CTL2_L) |= ADC12REFBURST;
}

//*****************************************************************************
//
//! Disables the reference buffer's burst ability.
//!
//! \param baseAddress is the base address of the ADC12_A module.
//!
//! Disables the reference buffer's burst ability, forcing the reference buffer
//! to remain on continuously.
//!
//! \return NONE
//
//*****************************************************************************
void ADC12_A_disableReferenceBurst (uint32_t baseAddress)
{
    HWREG8(baseAddress + OFS_ADC12CTL2_L) &= ~(ADC12REFBURST);
}

//*****************************************************************************
//
//! Use to set the reference buffer's sampling rate.
//!
//! \param baseAddress is the base address of the ADC12_A module.
//! \param samplingRateSelect is the specified maximum sampling rate.
//!        Valid values are
//!        \b ADC12_A_MAXSAMPLINGRATE_200KSPS [Default]
//!        \b ADC12_A_MAXSAMPLINGRATE_50KSPS
//!        Modified bits are \b ADC12SR of \b ADC12CTL2 register.
//!
//! Sets the reference buffer's sampling rate to the selected sampling rate. The
//! default sampling rate is maximum of 200-ksps, and can be reduced to a
//! maximum of 50-ksps to conserve power.
//!
//! \return NONE
//
//*****************************************************************************
void ADC12_A_setReferenceBufferSamplingRate (uint32_t baseAddress,
    unsigned short samplingRateSelect)
{
    assert(samplingRateSelect <= ADC12_A_MAXSAMPLINGRATE_50KSPS);

    HWREG8(baseAddress + OFS_ADC12CTL2_L) &= ~(ADC12SR);
    HWREG8(baseAddress + OFS_ADC12CTL2_L) |= samplingRateSelect;
}

//*****************************************************************************
//
//! Returns the address of the specified memory buffer for the DMA module.
//!
//! \param baseAddress is the base address of the ADC12_A module.
//! \param memoryIndex is the memory buffer to return the address of.
//!        Valid values are
//!        \b ADC12_A_MEMORY_0 [Default]
//!        \b ADC12_A_MEMORY_1
//!        \b ADC12_A_MEMORY_2
//!        \b ADC12_A_MEMORY_3
//!        \b ADC12_A_MEMORY_4
//!        \b ADC12_A_MEMORY_5
//!        \b ADC12_A_MEMORY_6
//!        \b ADC12_A_MEMORY_7
//!        \b ADC12_A_MEMORY_8
//!        \b ADC12_A_MEMORY_9
//!        \b ADC12_A_MEMORY_10
//!        \b ADC12_A_MEMORY_11
//!        \b ADC12_A_MEMORY_12
//!        \b ADC12_A_MEMORY_13
//!        \b ADC12_A_MEMORY_14
//!        \b ADC12_A_MEMORY_15
//!
//! Returns the address of the specified  memory buffer. This can be used in
//! conjunction with the DMA to store the converted data directly to memory.
//!
//! \return address of the specified memory buffer
//
//*****************************************************************************
uint32_t ADC12_A_getMemoryAddressForDMA (uint32_t baseAddress,
    uint8_t memoryIndex)
{
    return ( baseAddress + (0x20 + (memoryIndex * 2)) );
}

//*****************************************************************************
//
//! Returns the busy status of the ADC12_A core.
//!
//! \param baseAddress is the base address of the ADC12_A module.
//!
//! Returns the status of the ADC core if there is a conversion currently taking
//! place.
//!
//! \return ADC12_A_BUSY or ADC12_A_NOTBUSY dependent if there is a conversion
//!        currently taking place.
//
//*****************************************************************************
unsigned short ADC12_A_isBusy (uint32_t baseAddress)
{
    if (HWREG8(baseAddress + OFS_ADC12CTL1_L) & ADC12BUSY){
        return ( ADC12_A_BUSY) ;
    } else   {
        return ( ADC12_A_NOTBUSY) ;
    }
}

//*****************************************************************************
//
//Close the Doxygen group.
//! @}
//
//*****************************************************************************
